docs/blog/2012/0515.rst

20120515
========

Schuldnerberatung
-----------------

Fixed a bug in 
:meth:`lino.ui.extjs3.ext_elems.DecimalFieldelement.get_column_options`.
Fiddled with commas and points to get the formatting of amounts correct.
:func:`lino.mixins.printable.decfmt`


CBSS connection
---------------

Trying to understand why ``python manage.py test cbss.QuickTest`` 
doesn't work.

Getting answers from the people who run the CBSS is very hard. 
While waiting their answer I'll try to understand why there is 
an anomaly in the XML generated by SUDS:
it uses two different prefixes "ns1" and "SOAP-ENV" for the namespace 
"http://schemas.xmlsoap.org/soap/envelope/"::

  <?xml version="1.0" encoding="UTF-8"?>
  <SOAP-ENV:Envelope xmlns:ns0="http://ksz-bcss.fgov.be/connectors/WebServiceConnector" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
     <SOAP-ENV:Header/>
     <ns1:Body>
        <wsc:xmlString xmlns:wsc="http://ksz-bcss.fgov.be/connectors/WebServiceConnector">
        ...
        </wsc:xmlString>
     </ns1:Body>
  </SOAP-ENV:Envelope>

That's not elegant but should work after what I imagine to know about XML.

But I also found the following post from which I understand that 
there *are* SOAP parsers who might have problems with this:
http://stackoverflow.com/questions/4605687/invalid-suds-envelope

